[
  {
    "title": "Advance calculator",
    "year": "2023",
    "image": "../Images/projects/calculator_latest.png",
    "link": "https://v0-calculator-aj72z5mxf-dhruvkpatel004-8413s-projects.vercel.app/",
    "description": "A responsive web-based calculator built with Next.js, featuring basic arithmetic, scientific functions, and a clean modern UI."
  },
  {
    "title": "Does Urbanization Affect Power Outages?",
    "year": "2024",
    "image": "../Images/projects/urbanization_power_outage.jpg",
    "link": "https://pdhruv09.github.io/Urbanization_PowerOutage/",
    "description": "An analytical project for DSC 80 at UCSD analyzing major power outages in the U.S. from January 2000 to July 2016. Uses data from Purdue University's infrastructure lab."
  },
  {
    "title": "Interactive General Knowledge Quiz",
    "year": "2024",
    "image": "../Images/projects/interactive_quiz.jpg",
    "link": "https://pdhruv09.github.io/Interactive_Quiz/",
    "description": "A project using a double linked list to store and traverse quiz questions, options, and answers. Demonstrates expertise in data structures and interactive applications."
  },
  {
    "title": "League of Legends Win Rate Analysis",
    "year": "2025",
    "image": "../Images/projects/lol_analysis.jpg",
    "link": "https://pdhruv09.github.io/lol-esports-explorable/",
    "description": "Analyzes win rates by region using data from Oracle’s Elixir. Uses statistical analysis and hypothesis testing to evaluate competitive balance."
  },
  {
    "title": "Mapping Boston Cycling Routes",
    "year": "2025",
    "image": "../Images/projects/mapping.jpg",
    "link": "https://pdhruv09.github.io/Maping/",
    "description": "A Map that plots the bike routes of Boston and Cambridge City, it also shows the trips taken by each bike stand over a day time."
  },
  {
    "title": "Mouse Activity and Temperature Analysis",
    "year": "2025",
    "image": "../Images/projects/mouse_analysis.jpg",
    "link": "https://pdhruv09.github.io/Mouse-Activity-Explorable/",
    "description": "This project presents interactive visualizations that explore minute-level fluctuations in core body temperature and activity levels of mice over a 14-day period. The dataset captures daily rhythms, gender differences, and estrus cycle variations, providing a detailed view of biological and behavioral patterns."
  },
  {
    "title": "San Diego Transit Accessibility Analysis",
    "year": "2025",
    "image": "../Images/projects/sandiego_transit_map.png",
    "link": "https://pdhruv09.github.io/DSC_170_GIS_SanDiego_Transit_Map/",
    "description": "This project analyzes public transit accessibility across San Diego County using GIS and Python. Through buffer analysis, spatial difference operations, and ArcGIS Online, it identifies underserved census tracts (transit deserts) and proposes policy improvements via a StoryMap and interactive web app."
  },
  {
    "title": "FashionMNIST Model Comparison Dashboard",
    "year": "2025",
    "image": "../Images/projects/fashionmnist_dashboard.png",
    "link": "https://fashionmnist-dashboard.streamlit.app",
    "description": "This interactive dashboard compares MLP and CNN models trained on the FashionMNIST dataset. It visualizes test accuracy, prediction confidence, misclassified images, and confusion matrices. Built with PyTorch and Streamlit, the app allows users to explore individual predictions and evaluate model performance side by side."
  },
  {
    "title": "Differential Privacy-Private Evaluation",
    "year": "2025",
    "image": "../Images/projects/differential_privacy.png",
    "link": "https://github.com/PDhruv09/DSC_180A-Section_B15-Quater_1-Project/",
    "description": "Capstone project exploring user-level differential privacy on synthetic telemetry data. Implements and evaluates Gaussian and Laplace mechanisms to measure privacy-utility trade-offs using L∞ error and IOU metrics across 100 randomized runs."
  }
]
